# Даны координаты трех точек p1(x1; y1) p2(x2; y2) p3(x3; y3).
# Напишите функцию, проверябщую можно ли построить треугольник, соединив данные точки отрезками

def can_triangle(p1, p2, p3):
    x1 = p1[0]
    y1 = p1[1]
    x2 = p2[0]
    y2 = p2[1]
    x3 = p3[0]
    y3 = p3[1]
    if ((x2 - x1) ** 2 + (y2 - y1) ** 2) ** 0.5 == ((x3 - x2) ** 2 + (y3 - y3) ** 2) ** 0.5 == ((x3 - x1) ** 2 + (y3 - y1) ** 2) ** 0.5:
        return print('Можно')
    return print('Нельзя')


# Пример вызова функции
can_triangle((0, 0), (0, 1), (1, 0))

# Не забудьте протестировать вашу функцию
